Revit 2027 API
FillPattern.GetFillGrid Method
 Gets the specified fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillGrid GetFillGrid(
	int gridIdx
)
Public Function GetFillGrid (
	gridIdx As Integer
) As FillGrid
public:
FillGrid^ GetFillGrid(
	int gridIdx
)
member GetFillGrid :
        gridIdx : int -> FillGrid
Parameters
gridIdx Int32
 The index of the fill grid.
Return Value
FillGrid
 The fill grid.
Exceptions
Exception | Condition
ArgumentException |  The index of the FillGrid is not valid.
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace